#+TITLE: Todo

* [X] add ralphie as dependency
CLOSED: [2021-01-06 Wed 21:39]
* [X] use defcom to write hello-world command
CLOSED: [2021-01-06 Wed 21:39]
* [X] pull awesome config over from dotfiles
CLOSED: [2021-01-06 Wed 22:15]
* [X] write clawe install command
CLOSED: [2021-01-06 Wed 22:15]
* [X] write clawe awm-cli command
CLOSED: [2021-01-06 Wed 22:36]
* [X] get reasonable widget development loop going
CLOSED: [2021-01-07 Thu 15:53]
:LOGBOOK:
CLOCK: [2021-01-07 Thu 14:27]--[2021-01-07 Thu 15:02] =>  0:35
:END:
* [X] initial workspaces widget
CLOSED: [2021-01-08 Fri 15:54]
:LOGBOOK:
CLOCK: [2021-01-07 Thu 15:54]--[2021-01-07 Thu 16:29] =>  0:35
:END:
* [X] clawe restart that handles fennel errors before crashing
CLOSED: [2021-01-15 Fri 19:40]
* [X] keybindings updating as part of normal devloop
CLOSED: [2021-01-15 Fri 19:40]
:LOGBOOK:
CLOCK: [2021-01-15 Fri 19:32]--[2021-01-15 Fri 19:40] =>  0:08
:END:
instead of full awesome reboot
* [X] nicer looking workspaces widget
CLOSED: [2021-01-16 Sat 16:39]
* workspace features
** [X] highlight/indicate the currently selected workspace
CLOSED: [2021-01-16 Sat 13:52]
** [X] add click support to toggle-this/last workspace
CLOSED: [2021-01-16 Sat 15:15]
** [X] add hover styling support
CLOSED: [2021-01-16 Sat 15:15]
** [X] port workspace movement and selection commands from ralphie
CLOSED: [2021-01-16 Sat 16:39]
** [ ] indicate dirty or unpushed workspace
* [ ] pull set-keybindings fully into a clawe defcom command
* [ ] minimize the symlinked awesome-config
* [ ] write clawe awm-cli-fnl command
Writing fennel will be easier than writing lua
* [ ] add colorized edn pretty printer
* [ ] add cli fallbacks/helpers (fzf,rofi,zsh-completion)
* [ ] wrap in nix
deps:
- lua versions
- lua libs
- java version
- clojure deps/libs
- misc cli tools (none yet, but seems like it's coming)
* [ ] print keybindings command
* [ ] print workspaces (tags and clients)
* [ ] integrate my old awesome git-history from ~/dotfiles?
* [ ] achive luacheck zero in the awesome config
* [ ] unit-test ralphie install to support clawe/vapor clis in a portable way
args for
:uberscript-filename
:target-bin
:wrapper-bin
:project-directory
:notification-messages
:target namespaces
* [ ] catch and surface awm-cli callback errors
maybe via notifications/naughty
* [ ] startup command
- set background
- start workrave
* [ ] create workspace from open github repo in browser (or recent star)
* [ ] v2 check-for-errors: run luacheck over awesome config - .fnl and .lua files
* Ideas
** reloading clj-side at defcom-call-time
** defwidget - clojure dsl - reloads/hotswaps itself
** potential code

#+begin_src clojure
(defworkspace code
    {:floating  true
     :init-file "foo-blah"})

(defbinding code-hotkey
    {:key "mod u"}
    []
    (clawe/set-workspace! code))

(defapp spotify)
#+end_src

* Clawe Stream #1
:LOGBOOK:
CLOCK: [2021-01-08 Fri 12:59]--[2021-01-08 Fri 13:34] =>  0:35
:END:
** [X] intro to clawe
CLOSED: [2021-01-08 Fri 13:06]
** v1 workspaces list
*** [X] current dev loop
CLOSED: [2021-01-08 Fri 13:45]
*** [X] build clawe uberscript
CLOSED: [2021-01-08 Fri 14:39]
*** [X] add keybinding for reloading widgets: mod+r (move notes/garden to mod+g)
CLOSED: [2021-01-08 Fri 14:52]
*** [X] getting a working list of awesome tags pushed into there
CLOSED: [2021-01-08 Fri 14:53]
*** [X] dev loop for building the uberscript
CLOSED: [2021-01-08 Fri 15:54]
